INSERT INTO
  "roles" ("type")
VALUES
  ('student'),
  ('teacher'),
  ('admin')
ON CONFLICT ("type") DO NOTHING;

INSERT INTO
  "users" (
    "role_id",
    "email",
    "password",
    "name",
    "second_name",
    "third_name"
  )
VALUES
  (
    1,
    'ivan.ivanov@example.com',
    'hashed_password_1',
    'Иван',
    'Иванов',
    'Иванович'
  ),
  (
    1,
    'petr.petrov@example.com',
    'hashed_password_2',
    'Петр',
    'Петров',
    'Петрович'
  ),
  (
    1,
    'anna.sidorova@example.com',
    'hashed_password_3',
    'Анна',
    'Сидорова',
    'Алексеевна'
  ),
  (
    1,
    'maria.smirnova@example.com',
    'hashed_password_4',
    'Мария',
    'Смирнова',
    'Сергеевна'
  ),
  (
    1,
    'alexey.kuznetsov@example.com',
    'hashed_password_5',
    'Алексей',
    'Кузнецов',
    'Дмитриевич'
  ),
  (
    1,
    'ekaterina.vasilieva@example.com',
    'hashed_password_6',
    'Екатерина',
    'Васильева',
    'Андреевна'
  ),
  (
    1,
    'studen@university.com',
    'student123',
    'Дмитрий',
    'Николаев',
    'Владимирович'
  ),
  (
    1,
    'olga.fedorova@example.com',
    'hashed_password_8',
    'Ольга',
    'Федорова',
    'Игоревна'
  ),
  (
    2,
    'sergey.popov@example.com',
    'hashed_password_9',
    'Сергей',
    'Попов',
    'Викторович'
  ),
  (
    2,
    'natalia.lebedeva@example.com',
    'hashed_password_10',
    'Наталья',
    'Лебедева',
    'Павловна'
  ),
  (
    2,
    'teacher@university.com',
    'teacher123',
    'Андрей',
    'Соколов',
    'Михайлович'
  ),
  (
    2,
    'elena.kozлова@example.com',
    'hashed_password_12',
    'Елена',
    'Козлова',
    'Анатольевна'
  ),
  (
    3,
    'admin@university.com',
    'admin123',
    'Александр',
    'Морозов',
    'Борисович'
  )
ON CONFLICT ("email") DO NOTHING;

INSERT INTO
  "groups" ("name", "start_year", "duration_years")
VALUES
  ('3101', 2023, 4),
  ('4102', 2024, 2),
  ('2201', 2022, 5),
  ('3102', 2023, 4),
  ('3202', 2023, 4),
  ('5401', 2020, 2)
ON CONFLICT ("name") DO NOTHING;

INSERT INTO
  "students" ("user_id", "group_name")
VALUES
  (1, '3101'),
  (2, '3101'),
  (3, '4102'),
  (4, '3102'),
  (5, '2201'),
  (6, '3202'),
  (7, '4102'),
  (8, '3102')
ON CONFLICT ("user_id") DO NOTHING;

INSERT INTO
  "subjects" ("name")
VALUES
  ('Математика'),
  ('Программирование'),
  ('Базы данных'),
  ('Алгоритмы и структуры данных'),
  ('Веб-разработка'),
  ('Искусственный интеллект'),
  ('Операционные системы'),
  ('Компьютерные сети'),
  ('Тестирование ПО'),
  ('Проектирование ПО')
ON CONFLICT ("name") DO NOTHING;

INSERT INTO
  "student_group_rel" ("student_id", "group_name")
VALUES
  (1, '3101'),
  (2, '3101'),
  (3, '4102'),
  (4, '3102'),
  (5, '2201'),
  (6, '3202'),
  (7, '4102'),
  (8, '3102');

INSERT INTO
  "group_subject_rel" ("subject_id", "group_name")
VALUES
  (1, '3101'),
  (2, '3101'),
  (3, '4102'),
  (4, '3102'),
  (5, '2201'),
  (6, '3202'),
  (7, '4102'),
  (8, '3102');

INSERT INTO
  "users" (
    "role_id",
    "email",
    "password",
    "name",
    "second_name",
    "third_name"
  )
VALUES
  (
    1,
    'student1_3101@example.com',
    'hash_st1_3101',
    'Алексей',
    'Волков',
    'Сергеевич'
  ),
  (
    1,
    'student2_3101@example.com',
    'hash_st2_3101',
    'Татьяна',
    'Орлова',
    'Дмитриевна'
  ),
  (
    1,
    'student3_3101@example.com',
    'hash_st3_3101',
    'Михаил',
    'Зайцев',
    'Андреевич'
  ),
  (
    1,
    'student4_3101@example.com',
    'hash_st4_3101',
    'Евгения',
    'Павлова',
    'Ивановна'
  ),
  (
    1,
    'student5_3101@example.com',
    'hash_st5_3101',
    'Артем',
    'Семенов',
    'Викторович'
  ),
  (
    1,
    'student6_3101@example.com',
    'hash_st6_3101',
    'София',
    'Голубева',
    'Александровна'
  ),
  (
    1,
    'student7_3101@example.com',
    'hash_st7_3101',
    'Игорь',
    'Виноградов',
    'Олегович'
  ),
  (
    1,
    'student8_3101@example.com',
    'hash_st8_3101',
    'Вероника',
    'Крылова',
    'Павловна'
  ),
  (
    1,
    'student1_4102@example.com',
    'hash_st1_4102',
    'Кирилл',
    'Белов',
    'Игоревич'
  ),
  (
    1,
    'student2_4102@example.com',
    'hash_st2_4102',
    'Алиса',
    'Медведева',
    'Сергеевна'
  ),
  (
    1,
    'student3_4102@example.com',
    'hash_st3_4102',
    'Станислав',
    'Егоров',
    'Денисович'
  ),
  (
    1,
    'student4_4102@example.com',
    'hash_st4_4102',
    'Полина',
    'Ковалева',
    'Анатольевна'
  ),
  (
    1,
    'student5_4102@example.com',
    'hash_st5_4102',
    'Роман',
    'Ильин',
    'Владимирович'
  ),
  (
    1,
    'student6_4102@example.com',
    'hash_st6_4102',
    'Виктория',
    'Леонова',
    'Михайловна'
  ),
  (
    1,
    'student7_4102@example.com',
    'hash_st7_4102',
    'Даниил',
    'Макаров',
    'Артемович'
  ),
  (
    1,
    'student8_4102@example.com',
    'hash_st8_4102',
    'Юлия',
    'Антонова',
    'Романовна'
  ),
  (
    1,
    'student1_3102@example.com',
    'hash_st1_3102',
    'Глеб',
    'Тихонов',
    'Алексеевич'
  ),
  (
    1,
    'student2_3102@example.com',
    'hash_st2_3102',
    'Елизавета',
    'Филиппова',
    'Валерьевна'
  ),
  (
    1,
    'student3_3102@example.com',
    'hash_st3_3102',
    'Константин',
    'Давыдов',
    'Семенович'
  ),
  (
    1,
    'student4_3102@example.com',
    'hash_st4_3102',
    'Арина',
    'Жукова',
    'Геннадьевна'
  ),
  (
    1,
    'student5_3102@example.com',
    'hash_st5_3102',
    'Федор',
    'Родионов',
    'Николаевич'
  ),
  (
    1,
    'student6_3102@example.com',
    'hash_st6_3102',
    'Ксения',
    'Матвеева',
    'Станиславовна'
  ),
  (
    1,
    'student7_3102@example.com',
    'hash_st7_3102',
    'Вадим',
    'Комаров',
    'Борисович'
  ),
  (
    1,
    'student8_3102@example.com',
    'hash_st8_3102',
    'Анастасия',
    'Шарова',
    'Олеговна'
  ),
  (
    1,
    'student1_2201@example.com',
    'hash_st1_2201',
    'Максим',
    'Щербаков',
    'Викторович'
  ),
  (
    1,
    'student2_2201@example.com',
    'hash_st2_2201',
    'Диана',
    'Михеева',
    'Юрьевна'
  ),
  (
    1,
    'student3_2201@example.com',
    'hash_st3_2201',
    'Ярослав',
    'Бирюков',
    'Степанович'
  ),
  (
    1,
    'student4_2201@example.com',
    'hash_st4_2201',
    'Ульяна',
    'Селиверстова',
    'Андреевна'
  ),
  (
    1,
    'student5_2201@example.com',
    'hash_st5_2201',
    'Тимур',
    'Константинов',
    'Евгеньевич'
  ),
  (
    1,
    'student6_2201@example.com',
    'hash_st6_2201',
    'Марина',
    'Тарасова',
    'Георгиевна'
  ),
  (
    1,
    'student7_2201@example.com',
    'hash_st7_2201',
    'Григорий',
    'Сорокин',
    'Павлович'
  ),
  (
    1,
    'student8_2201@example.com',
    'hash_st8_2201',
    'Алёна',
    'Рябова',
    'Ивановна'
  ),
  (
    1,
    'student1_3202@example.com',
    'hash_st1_3202',
    'Никита',
    'Поляков',
    'Артурович'
  ),
  (
    1,
    'student2_3202@example.com',
    'hash_st2_3202',
    'Валерия',
    'Карпова',
    'Денисовна'
  ),
  (
    1,
    'student3_3202@example.com',
    'hash_st3_3202',
    'Арсений',
    'Шишкин',
    'Романович'
  ),
  (
    1,
    'student4_3202@example.com',
    'hash_st4_3202',
    'Светлана',
    'Блинова',
    'Витальевна'
  ),
  (
    1,
    'student5_3202@example.com',
    'hash_st5_3202',
    'Егор',
    'Кудрявцев',
    'Александрович'
  ),
  (
    1,
    'student6_3202@example.com',
    'hash_st6_3202',
    'Любовь',
    'Лапина',
    'Федоровна'
  ),
  (
    1,
    'student7_3202@example.com',
    'hash_st7_3202',
    'Семен',
    'Прохоров',
    'Ильич'
  ),
  (
    1,
    'student8_3202@example.com',
    'hash_st8_3202',
    'Элина',
    'Нестерова',
    'Сергеевна'
  ),
  (
    1,
    'student1_5401@example.com',
    'hash_st1_5401',
    'Павел',
    'Харитонов',
    'Вадимович'
  ),
  (
    1,
    'student2_5401@example.com',
    'hash_st2_5401',
    'Инна',
    'Семенова',
    'Олеговна'
  ),
  (
    1,
    'student3_5401@example.com',
    'hash_st3_5401',
    'Вячеслав',
    'Фомин',
    'Аркадьевич'
  ),
  (
    1,
    'student4_5401@example.com',
    'hash_st4_5401',
    'Регина',
    'Горбунова',
    'Вячеславовна'
  ),
  (
    1,
    'student5_5401@example.com',
    'hash_st5_5401',
    'Олег',
    'Дорофеев',
    'Семенович'
  ),
  (
    1,
    'student6_5401@example.com',
    'hash_st6_5401',
    'Лидия',
    'Ефимова',
    'Романовна'
  ),
  (
    1,
    'student7_5401@example.com',
    'hash_st7_5401',
    'Илья',
    'Моисеев',
    'Геннадьевич'
  ),
  (
    1,
    'student8_5401@example.com',
    'hash_st8_5401',
    'Василиса',
    'Агафонова',
    'Артемовна'
  )
ON CONFLICT ("email") DO NOTHING;

WITH
  new_students AS (
    SELECT
      u.id AS user_id,
      CASE
        WHEN u.email LIKE '%3101%' THEN '3101'
        WHEN u.email LIKE '%4102%' THEN '4102'
        WHEN u.email LIKE '%3102%' THEN '3102'
        WHEN u.email LIKE '%2201%' THEN '2201'
        WHEN u.email LIKE '%3202%' THEN '3202'
        WHEN u.email LIKE '%5401%' THEN '5401'
      END AS group_name
    FROM
      users u
    WHERE
      u.email LIKE 'student%'
      AND u.role_id = 1
  )
INSERT INTO
  "students" ("user_id", "group_name")
SELECT
  user_id,
  group_name
FROM
  new_students
ON CONFLICT ("user_id") DO NOTHING;

INSERT INTO
  "student_group_rel" ("student_id", "group_name")
SELECT
  s.id,
  s.group_name
FROM
  students s
WHERE
  s.user_id IN (
    SELECT
      id
    FROM
      users
    WHERE
      email LIKE 'student%'
  )
ON CONFLICT ("student_id", "group_name") DO NOTHING;

INSERT INTO
  "lessons" (
    "subject_id",
    "teacher_id",
    "group_name",
    "lesson_date_start",
    "lesson_duration_hours"
  )
VALUES
  (1, 9, '3101', '2025-01-01 09:00:00', 2),
  (2, 10, '3101', '2025-01-01 11:30:00', 1.5),
  (1, 9, '3101', '2025-01-01 13:30:00', 2),
  (2, 10, '3101', '2025-01-01 16:00:00', 3),
  (1, 9, '3101', '2025-01-01 19:00:00', 1),
  (3, 11, '4102', '2025-01-01 08:30:00', 2),
  (7, 12, '4102', '2025-01-01 11:00:00', 2),
  (3, 11, '4102', '2025-01-01 13:30:00', 1.5),
  (7, 12, '4102', '2025-01-01 15:30:00', 2.5),
  (3, 11, '4102', '2025-01-01 18:30:00', 2),
  (4, 9, '3102', '2025-01-01 09:15:00', 1.5),
  (8, 11, '3102', '2025-01-01 11:15:00', 2),
  (4, 9, '3102', '2025-01-01 13:45:00', 1),
  (8, 11, '3102', '2025-01-01 15:15:00', 3),
  (4, 9, '3102', '2025-01-01 18:45:00', 2),
  (5, 10, '2201', '2025-01-01 08:00:00', 2.5),
  (6, 10, '2201', '2025-01-01 11:15:00', 2),
  (7, 10, '2201', '2025-01-01 14:00:00', 1.5),
  (8, 10, '2201', '2025-01-01 16:15:00', 3),
  (9, 10, '2201', '2025-01-01 20:00:00', 2),
  (6, 12, '3202', '2025-01-01 10:00:00', 2),
  (6, 12, '3202', '2025-01-01 12:30:00', 1.5),
  (6, 12, '3202', '2025-01-01 14:30:00', 2),
  (6, 12, '3202', '2025-01-01 17:00:00', 2.5),
  (6, 12, '3202', '2025-01-01 20:00:00', 1.5),
  (9, 11, '5401', '2025-01-01 09:30:00', 2),
  (10, 12, '5401', '2025-01-01 12:00:00', 1.5),
  (9, 11, '5401', '2025-01-01 14:00:00', 2.5),
  (10, 12, '5401', '2025-01-01 17:00:00', 2),
  (9, 11, '5401', '2025-01-01 19:30:00', 1.5),
  (1, 9, '3101', '2025-01-02 08:30:00', 1.5),
  (2, 10, '3101', '2025-01-02 10:30:00', 2),
  (1, 9, '3101', '2025-01-02 13:00:00', 2),
  (2, 10, '3101', '2025-01-02 15:30:00', 2.5),
  (1, 9, '3101', '2025-01-02 18:30:00', 1),
  (3, 11, '4102', '2025-01-02 09:00:00', 2),
  (7, 12, '4102', '2025-01-02 11:30:00', 1.5),
  (3, 11, '4102', '2025-01-02 13:30:00', 2),
  (7, 12, '4102', '2025-01-02 16:00:00', 3),
  (3, 11, '4102', '2025-01-02 19:30:00', 2),
  (4, 9, '3102', '2025-01-02 08:45:00', 2),
  (8, 11, '3102', '2025-01-02 11:00:00', 2.5),
  (4, 9, '3102', '2025-01-02 14:00:00', 1.5),
  (8, 11, '3102', '2025-01-02 16:00:00', 2),
  (4, 9, '3102', '2025-01-02 18:30:00', 1.5),
  (5, 10, '2201', '2025-01-02 09:15:00', 3),
  (5, 10, '2201', '2025-01-02 12:45:00', 2),
  (5, 10, '2201', '2025-01-02 15:15:00', 2.5),
  (5, 10, '2201', '2025-01-02 18:15:00', 1.5),
  (5, 10, '2201', '2025-01-02 20:15:00', 2),
  (6, 12, '3202', '2025-01-02 08:00:00', 2),
  (6, 12, '3202', '2025-01-02 10:30:00', 1.5),
  (6, 12, '3202', '2025-01-02 12:30:00', 2.5),
  (6, 12, '3202', '2025-01-02 15:30:00', 2),
  (6, 12, '3202', '2025-01-02 18:00:00', 1.5),
  (9, 11, '5401', '2025-01-02 10:00:00', 2.5),
  (10, 12, '5401', '2025-01-02 13:00:00', 2),
  (9, 11, '5401', '2025-01-02 15:30:00', 1.5),
  (10, 12, '5401', '2025-01-02 17:30:00', 2),
  (9, 11, '5401', '2025-01-02 20:00:00', 1.5);

INSERT INTO
  "group_subject_rel" ("subject_id", "group_name")
VALUES
  (1, '4102'),
  (2, '4102'),
  (3, '3101'),
  (4, '3101'),
  (5, '3102'),
  (6, '3102'),
  (7, '3202'),
  (8, '3202'),
  (9, '2201'),
  (10, '2201'),
  (1, '5401'),
  (2, '5401'),
  (3, '5401'),
  (4, '5401'),
  (5, '5401'),
  (6, '5401'),
  (7, '5401'),
  (8, '5401'),
  (9, '5401'),
  (10, '5401')
ON CONFLICT ("subject_id", "group_name") DO NOTHING;
